export const cityData: { [key: string]: string[] } = {
  '東京都': [
    '千代田区', '中央区', '港区', '新宿区', '文京区', '台東区',
    '墨田区', '江東区', '品川区', '目黒区', '大田区', '世田谷区',
    '渋谷区', '中野区', '杉並区', '豊島区', '北区', '荒川区',
    '板橋区', '練馬区', '足立区', '葛飾区', '江戸川区'
  ],
  '神奈川県': [
    '横浜市', '川崎市', '相模原市', '横須賀市', '平塚市',
    '鎌倉市', '藤沢市', '小田原市', '茅ヶ崎市', '逗子市'
  ],
  '千葉県': [
    '千葉市', '市川市', '船橋市', '松戸市', '野田市',
    '柏市', '流山市', '八千代市', '我孫子市', '鎌ケ谷市'
  ],
  '埼玉県': [
    'さいたま市', '川越市', '熊谷市', '川口市', '所沢市',
    '春日部市', '狭山市', '上尾市', '草加市', '越谷市'
  ]
  // 他の都道府県も同様に追加
} 